Repository: ErikaIwakiri/DebianCorpus
Catalog: TmxMerged.tmx
Source language: en_us
Languages: pt_pt

source: · Parts of a free software community that distribute source code and not object code probably have slightly less patent risk.
pt_pt: · Partes de uma comunidade de software livre que distribuem código-fonte e não código-objeto provavelmente terão menor chances de risco de patente.

source: · Distributing free software commercially is probably more risky than distributing software gratis.
pt_pt: · Distribuir software livre comercialmente é provavelmente mais arriscado do que distribuir software de graça.

source: · Having the ability to remove features and packages quickly and easily from distribution will help mitigate any damages the community could incur.
pt_pt: · Ter a capacidade de remover funcionalidades e pacotes das distribuições, rapidamente e com facilidade, ajudará a mitigar os danos que a comunidade possa sofrer.

source: · Patent litigation is not an amateur sport.
pt_pt: · O litígio de patente não é um esporte amador.

source: If you are contacted by anyone threatening to assert a patent against you, contact the Software Freedom Law Center or another qualified attorney as soon as possible.
pt_pt: Se você for contatado por alguém que lhe ameaçou a imposição de patente, contate o Software Freedom Law Center ou outro(a) advogado(a) qualificado(a) o mais rapidamente possível.

source: Acknowledgements.
pt_pt: Agradecimentos.

source: This document has been prepared by lawyers at SFLC, with inputs from Stefano Zacchiroli, on behalf of the Debian Project.
pt_pt: Este documento foi preparado pelos(as) advogados(as) do SFLC, com contribuições de Stefano Zacchiroli, em nome do Projeto Debian.

source: français Nederlands 日本語 (Nihongo) Português Русский (Russkij)
pt_pt: English français Nederlands 日本語 (Nihongo) Русский (Russkij)

source: Last Modified: Sun, Feb 4 05:58:49 UTC 2018 Last Built: Tue, Aug 6 19:49:34 UTC 2024
pt_pt: Última Modificação: Ter, 22 de Fev de 2022, 03:20:35 UTC Última compilação: Ter, 6 de Ago de 2024, 22:08:50 UTC

source: The Debian Women Project / How to get involved in Debian Women
pt_pt: O projeto Debian Women / Como se envolver no Debian Women

source: How to get involved in Debian Women
pt_pt: Como se envolver no Debian Women

source: Subscribe to the mailing list
pt_pt: Inscreva-se na lista de discussão

source: Get to know the other people involved in the Debian Women project and help shape the future of the project by participating in discussion on our mailing list.
pt_pt: Conheça outras pessoas envolvidas no projeto Debian Women e ajude a moldar o futuro do projeto participando de discussões na nossa lista de discussão.

source: The debian-women list page includes a form for subscribing and unsubscribing, as well as list archives.
pt_pt: A página da lista debian-women possui um formulário para inscrição e desinscrição, assim como os arquivos da lista.

source: (This is true for all the Debian list links in this document).
pt_pt: (Isso se aplica a todos os links das listas do Debian neste documento).

source: In addition, everyone is encouraged to subscribe to the debian-devel-announce mailing list, to stay informed about the most important changes affecting Debian.
pt_pt: Além disso, todas são encorajadas a se inscreverem na lista de discussão debian-devel-announce, para se manterem informadas sobre as mudanças mais importantes que afetam o Debian.

source: Submit your bio for the Profiles page
pt_pt: Envie a sua biografia para a página de perfis

source: Are you a Debian volunteer, package maintainer, translator, or HOWTO author?
pt_pt: Você é uma voluntária Debian, mantenedora de pacotes, tradutora, ou autora de HOWTO?

source: We would like to recognize you for your hard work by adding you to our Profiles page of women who have contributed to Debian.
pt_pt: Nós gostaríamos de reconhecê-la pelo seu esforço adicionando-a à nossa página de perfis de mulheres que têm contribuído com o Debian.

source: Please tell us about yourself and your efforts by answering some questions and submitting your answers to Laura Arjona.
pt_pt: Por favor, conte-nos sobre você e seus esforços respondendo algumas perguntas e enviando suas respostas para Laura Arjona.

source: Contribute content for the project website
pt_pt: Contribua com conteúdo para o site web do projeto

source: We are always looking for new content for the site.
pt_pt: Nós sempre estamos buscando por novo conteúdo para o site.

source: If you have suggestions or content to contribute, contact the maintainer of that area:
pt_pt: Se você tem sugestões ou conteúdo para contribuir, entre em contato com a mantenedora da respectiva área:

source: · General, Documents, FAQs, and Links: If you want to help out with the website but don't have a particular area of interest, contact Erinn.
pt_pt: · Geral, documentos, FAQs e links: Se você quer ajudar com o site web mas não tem uma área de interesse em particular, entre em contato com Erinn.

source: · Events: If you have an idea for a Debian Women event or are giving a Debian Women related talk or BoF at another Linux/FOSS event, let the mailing list know, so others can join you.
pt_pt: · Eventos: Se você tem uma ideia para um evento do Debian Women, ou está dando uma palestra relacionada ao Debian Women, ou uma BoF ("Birds of a Feather") em outro evento de Linux/FLOSS, informe na lista de discussão, para que outras possam se juntar a você.

source: · Profiles: If you would like to help compile information for the Profiles page or recommend someone for inclusion, please contact Laura Arjona.
pt_pt: · Perfis: Se você gostaria de ajudar a reunir informações para a página de perfis ou recomenda alguém para incluirmos, por favor entre em contato com Laura Arjona.

source: dansk español français Nederlands Português Русский (Russkij) svenska
pt_pt: dansk English español français Nederlands Русский (Russkij) svenska

source: Last Modified: Thu, Oct 13 10:40:17 UTC 2016 Last Built: Tue, Aug 6 19:59:16 UTC 2024
pt_pt: Última Modificação: Seg, 8 de Jun de 2020, 05:13:45 UTC Última compilação: Ter, 6 de Ago de 2024, 22:13:09 UTC

source: Copyright © 1997-2016 SPI and others; See license terms
pt_pt: Copyright © 1997-2020 SPI e outros; Veja os termos de licença

source: Debian Developers' Corner / Autobuilder network / Wanna-build states: an explanation
pt_pt: Canto dos(as) desenvolvedores(as) Debian / Rede autobuilder / Estados wanna-build: uma explicação

source: Wanna-build states: an explanation
pt_pt: Estados wanna-build: uma explicação

source: This page tries to explain what every wanna-build state means and what will happen to a package when it's in that state.
pt_pt: Esta página tenta explicar o que significa cada estado wanna-build e o que acontecerá com um pacote quando ele estiver nesse estado.

source: Its target audience are Debian package maintainers that try to understand why their package has, or has not, been built for a specific architecture.
pt_pt: Sua audiência-alvo é mantenedores(as) de pacotes Debian que tentam entender porque seu pacote foi, ou não foi, construído para uma determinada arquitetura.

source: Also, an explanation of the different log results is given.
pt_pt: Além disso, é dada uma explicação dos diferentes resultados de log.

source: If you need a rebuild of your package, you can ask for wanna-build actions
pt_pt: Se precisar de uma reconstrução do seu pacote, você pode solicitar ações wanna-build

source: Finally, a flowchart version of the wanna-build states is available, but do note that it doesn't talk about everything mentioned in this document.
pt_pt: Finalmente, uma versão em fluxograma dos estados wanna-build está disponível, mas note que ele não fala sobre tudo que é mencionado neste documento.

source: The wanna-build states
pt_pt: Os estados wanna-build

source: For every Debian-supported architecture, there's a wanna-build database installed on buildd.debian.org, with all packages and their current compilation state.
pt_pt: Para toda arquitetura suportada pelo Debian, existe um banco de dados wanna-build instalado em buildd.debian.org, com todos os pacotes e seus estados atuais de compilação.

source: There are 8 states: needs-build, building, uploaded, dep-wait, BD-Uninstallable, failed, not-for-us, and installed.
pt_pt: Existem 8 estados: needs-build, building, uploaded, dep-wait, BD-Uninstallable, failed, not-for-us e installed.

source: Their meaning is as follows:
pt_pt: Seus significados:

source: A package marked needs-build has seen an upload of a new version by its maintainer, but for a different architecture than the one this wanna-build database is for; as such, it needs a rebuild.
pt_pt: Um pacote marcado needs-build teve uma nova versão enviada pelo(a) mantenedor(a), mas para uma arquitetura diferente daquela que este banco de dados wanna-build dirige-se; como tal, ele precisa de uma reconstrução.

source: If the state is needs-build, it has not been picked up by an autobuilder yet, but it will be (once one is available at a time the specific package is near the top of the list).
pt_pt: Se o estado é needs-build, ele ainda não foi pego por um autobuilder, mas será (quando um esteja disponível no momento que tal pacote esteja próximo ao topo da lista).

source: People commonly say a package is queued for rebuild when they are talking about a package in the needs-build state.
pt_pt: As pessoas normalmente dizem que um pacote está na fila para reconstruir quando elas estão falando sobre um pacote no estado needs-build.

source: It may be interesting to note that the needs-build queue is not a FIFO queue; rather, the ordering used is based on the following criteria:
pt_pt: Pode ser interessante notar que a fila needs-build não é uma fila FIFO; ao contrário, a ordenação utilizada é baseada nos seguintes critérios:

source: Packages' previous compilation states; packages that have been built previously are given priority over new packages.
pt_pt: Estados anteriores de compilação dos pacotes; os pacotes que foram previamente construídos recebem prioridade sobre novos pacotes.

source: 2. priorities (packages with required priority are built before packages with extra priority)
pt_pt: 2. prioridades (pacotes com prioridade required - requerido - são construídos antes que pacotes com prioridade extra)

source: The section a package is in.
pt_pt: A seção em que um pacote está.

source: This ordering is based on what packages are deemed more important; e.g., section games is built after section base, and section libs is built before devel.
pt_pt: Este ordenamento é baseado naquilo que se considera mais importante sobre os pacotes; por exemplo, a seção games é construída depois da seção base, e a seção libs é construída antes de devel.

source: 4. an asciibetical ordering on the package name.
pt_pt: 4. uma ordem "asciibética" pelo nome do pacote.

source: Additionally, under certain conditions, it may happen that a buildd will not take packages at the head of the queue; for instance, when a buildd can't find the source of a given package, it will put it back in the queue (where it will then again be put at its previous position, i.e. the head of the queue), but it will ignore the package for a few hours.
pt_pt: Adicionalmente, sob certas condições, pode acontecer que um buildd não receba pacotes do começo da fila; por exemplo, quando um buildd não consegue encontrar a fonte de um dado pacote, ele o colocará de volta na fila (onde então ele será novamente colocado em sua posição anterior, isto é, no começo da fila), mas ele ignorará o pacote por algumas horas.

source: Another example where this might happen is when an architecture has multiple autobuilders; in that case, the architecture's porters may choose to build larger packages on their faster autobuilders, and leave the smaller ones for the slower machines in the pool.
pt_pt: Outro exemplo onde isto poderia acontecer é quando uma arquitetura tem múltiplos autobuilders; neste caso, as pessoas que portam a arquitetura podem escolher construir pacotes maiores em seus autobuilders mais rápidos e deixar os pacotes menores para as máquinas mais lentas do grupo.

source: A buildd can theoretically also explicitly request a different section ordering, but that is not usually done.
pt_pt: Um buildd também pode, em tese, requisitar explicitamente uma ordenação de seção diferente, mas isto geralmente não é feito.

source: There could be other situations where the queue order seems to be ignored; but note that they are all exceptions.
pt_pt: Poderiam existir outras situações onde a ordem da fila parece ser ignorada; mas note que são sempre exceções.

source: A package is marked building from the moment an autobuilder picks it from the top of the wanna-build queue until the moment the autobuilder admin replies to the log.
pt_pt: Um pacote é marcado com building do momento em que um autobuilder o pega do topo da fila wanna-build até o momento em que a administração do autobuilder responde ao log.

source: As packages are not picked one by one, this means a package can be (and usually is) marked building before the build has actually started; however, as buildd builds packages in its local queue on a FIFO basis, it should not take too long anymore.
pt_pt: Como os pacotes não são escolhidos um a um, isto significa que um pacote pode ser (e geralmente é) marcado com building antes que a construção tenha realmente iniciado; contudo, como o buildd constrói pacotes em sua fila local com base em FIFO, não deve demorar muito.

source: Also, note that the state of a package is not modified once the build is complete; only when the autobuilder admin comes around to replying to the logs.
pt_pt: Além disso, note que o estado de um pacote não é modificado um vez que a construção foi completada; somente quando a administração do autobuilder aparece para responder aos logs.

source: When a build attempt was successful, a build log is sent to the autobuilder admin and to buildd.debian.org.
pt_pt: Quando uma tentativa de construção é bem sucedida, um log de construção é enviado para a administração do autobuilder e para buildd.debian.org.

source: The autobuilder maintainer will then sign the .changes file which is embedded in the build log, and send it to the autobuilder.
pt_pt: Então o(a) mantenedor(a) do autobuilder assina o arquivo .changes que está embutido no log de construção e o envia para o autobuilder.

source: In reaction, the autobuilder will upload the package and set its state to uploaded.
pt_pt: Como reação, o autobuilder fará o upload do pacote e definirá seu estado para uploaded.

source: As such, a package in this state can be found in the incoming queue (somewhere).
pt_pt: Como tal, um pacote neste estado pode ser encontrado na fila do repositório de entrada (incoming) (em algum lugar).

source: An autobuilder will not touch a package anymore once it's state is uploaded, at least not until the next upload or until a porter manually modifies the state of a package.
pt_pt: Um autobuilder não tocará mais em um pacote uma vez que seu estado é uploaded, ou pelo menos não o fará até o próximo upload ou até que a equipe de porte manualmente modifique o estado do pacote.

source: When a package fails due to missing build-time dependencies, the autobuilder maintainer will send a mail to the autobuilder, instructing it to remove the package sources and to mark the package as dep-wait on the missing build-dependencies.
pt_pt: Quando um pacote falha devido à ausência de dependências durante o tempo de construção (build-time), o(a) mantenedor(a) do autobuilder enviará um e-mail para o aautobuilder, instruindo-o a remover as fontes do pacote e a marcar o pacote como dep-wait para as dependências de construção (build-dependencies).

source: A package in such a state will automatically, without human intervention, be marked needs-build once said dependencies are available.
pt_pt: Um pacote em tal estado, automaticamente e sem intervenção humana, será marcado com needs-build quando essas dependências estiverem disponíveis.

source: Originally, a package had to see a build attempt before the maintainer would manually place it in the dep-wait state.
pt_pt: Originalmente, um pacote tinha que passar por uma tentativa de construção antes que o(a) mantenedor(a) pudesse colocá-lo manualmente no estado dep-wait.

source: However, in august 2005 some code was added to wanna-build which will make a package move from the installed state directly to the dep-wait state, if that is appropriate.
pt_pt: Contudo, em agosto de 2005, alguns códigos foram adicionados para o wanna-build, os quais fazem com que um pacote se mova do estado installed diretamente para o estado dep-wait se isso for apropriado.

source: There are two specific cases in which it may happen that a package is marked dep-wait forever; these are when a typing error happened by specifying the dep-wait dependencies (so that the package is marked dep-wait on a package that does not and will not ever exist) and when a build-time dependency is declared on a package which is marked not-for-us, or which is in the packages-arch-specific list.
pt_pt: Existem dois casos específicos em que pode acontecer que um pacote fique marcado como dep-wait para sempre; quando um erro de digitação ocorre ao especificar as dependências dep-wait (de modo que o pacote é marcado como dep-wait para um pacote que não existe e nunca existirá) e quando uma dependência de tempo de construção é declarada em um pacote que está marcado como not-for-us, que está na lista packages-arch-specific.

source: As an example to the latter, consider three packages: a package foo, which exists for i386 only; a package bar, which exists for m68k only (and which roughly performs the same function); and a package baz, which can be built with one of foo or bar.
pt_pt: Como um exemplo deste último caso, considere três pacotes: um pacote foo, que existe para i386 somente; um pacote bar, que existe para m68k somente (e que realiza aproximadamente a mesma função); e um pacote baz, que pode ser construído com um deles, foo ou bar.

source: Should the maintainer of the baz package forget to add bar to the Build-Depends, and should he or she add it when it is noticed that baz is dep-waiting on a non-existing foo for m68k, then the dep-wait state for m68k will have to be manually lifted by the m68k porters.
pt_pt: Se o(a) mantenedor(a) do pacote baz esquecer de adicionar bar ao Build-Depends, e se ela ou ele adicioná-lo quando notificar-se que baz está em dep-wait para um pacote foo não existente para m68k, então o estado dep-wait para m68k terá que ser manualmente retirado pela equipe de porte do m68k.

source: During debconf9, Joachim Breitner had the idea of using edos-debcheck to verify build-dependency installability of packages that would otherwise go into state Needs-Build.
pt_pt: Durante a DebConf9, o Joachim Breitner teve a ideia de usar edos-debcheck para verificar a instalabilidade de dependências de construção (build-dependency) dos pacotes que, de outro modo, iriam para o estado Needs-Build.

source: At that point, wanna-build already had the ability to check the immediate availability of build-dependencies; but if a package couldn't be installed because it build-depends on a which depends on b which depends on c (>=1.2.3) and c is still at version 1.2.2, this would not be detected, and the build would fail early because of unavailable build-dependencies.
pt_pt: Naquele momento, o wanna-build já tinha a capacidade de verificar a disponibilidade imediata de dependências de construção; mas se um pacote não pudesse ser instalado porque, na construção, ele depende de a, que depende de b, que depende de c (>=1.2.3), e c ainda está na versão 1.2.2, isto não seria detectado e a construção logo falharia devido a dependências de construção não disponíveis.

source: Figuring those out was a manual process for the buildd admin, and, usually, a lengthy one at that.
pt_pt: Essa descoberta era um processo manual para a administração do buildd e, geralmente, era um processo demorado.

source: With the BD-Uninstallable patch, this is no longer a problem.
pt_pt: Com o patch BD-Uninstallable, não é mais um problema.

source: When your package is in BD-Uninstallable, it means one of the build-dependencies is not installable (either immediately, or because part of its dependency tree is not available).
pt_pt: Quando seu pacote está em BD-Uninstallable, significa que uma das dependências de construção não é instalável (imediatamente ou porque parte de sua árvore de dependências não está disponível).

source: Unfortunately, the BD-Uninstallable patch does not provide information about which package, exactly, is missing; please use edos-debcheck to find out.
pt_pt: Infelizmente, o patch BD-Uninstallable não fornece informações sobre qual pacote, exatamente, está faltando; por favor, use edos-debcheck para descobrir.

source: This problem will, however, solve itself once the missing dependencies are indeed available, and at that point your package will automatically move to Needs-Build again.
pt_pt: Entretanto, este problema será resolvido por si mesmo uma vez que as dependências ausentes estejam de fato disponíveis e, neste momento, seu pacote automaticamente se moverá para Needs-Build novamente.

source: If a build attempt failed, and the autobuilder maintainer decides it is really a failure that should not be retried, a package is marked as failed.
pt_pt: Se uma tentativa de construção falhou, e o(a) mantenedor(a) do autobuilder decidir que é mesmo uma falha cuja tentativa não deve ser repetida, um pacote é marcado como failed.

source: A package will not leave this state until a porter decides it should do so, or until a new version is available.
pt_pt: Um pacote não sairá deste estado até que alguém do porte decida que isso ocorra ou até que uma nova versão esteja disponível.

source: However, when a new version of a package is available which was marked as failed in the previous version, the autobuilder will ask its admin whether or not the package should be retried; this is so that packages which will obviously fail again will not waste buildd time.
pt_pt: Contudo, quando uma nova versão de um pacote está disponível, o qual foi marcado como failed em uma versão anterior, o autobuilder perguntará para sua administração se o pacote deve ser tentado novamente ou não; isso é feito para que os pacotes que obviamente falharão novamente não gastem o tempo do buildd.

source: Although failing a package before trying a build is hardly ever the right thing to do, the option is available to the autobuilder admin.
pt_pt: Embora falhar um pacote antes de tentar uma construção dificilmente seja a coisa certa a se fazer, a opção está disponível para a administração do autobuilder.

source: Note that a package will never be marked failed without human intervention.
pt_pt: Note que o pacote nunca será marcado como failed sem intervenção humana

source: Certain specific packages are architecture-specific; for instance, lilo, an i386 boot loader, should not be rebuilt on alpha, m68k, or s390.
pt_pt: Certos pacotes são específicos a uma arquitetura; por exemplo, o lilo, um boot loader do i386, não deve ser reconstruído em alpha, m68k ou s390.

source: However, wanna-build does not look at the control file of a package when creating its database; only at the packages' name and section, the previous build state, and its priority.
pt_pt: Contudo, o wanna-build não olha para o arquivo control de um pacote quando cria seu banco de dados; somente para o nome e a seção do pacote, o estado anterior de construção e sua prioridade.
